In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("international-visitor-arrivals-by-country-of-nationality.csv")

In [3]:
df.head()

    period    region                          con  arv_count
0  2013-01  Americas                       Canada      13080
1  2013-01  Americas                          USA      48815
2  2013-01  Americas  Other Countries in Americas       6742
3  2013-01      Asia            Brunei Darussalam       4709
4  2013-01      Asia                    Indonesia     257842

In [4]:
df.shape

(1344, 4)

In [5]:
df.dtypes

period       object
region       object
con          object
arv_count     int64
dtype: object

In [6]:
total_visitor_by_country = df.groupby("con")["arv_count"].sum()

In [7]:
total_visitor_by_country

con
Australia                            2025732
Austria                                57340
Bangladesh                            244549
Belgium &  Luxembourg                  58598
Brunei Darussalam                     125039
Canada                                270537
China                                4837558
Denmark                                75911
Egypt                                  10801
Finland                                66032
France                                399402
Germany                               567745
Greece                                 18251
India                                2031437
Indonesia                            6142444
Iran                                   28174
Israel                                 30373
Italy                                 162742
Japan                                1785444
Kuwait                                 17504
Malaysia                             2019242
Mauritius                              17460
Myanmar                               214799
Nepal                                  35804
Netherlands                           203133
New Zealand                           273974
Norway                                 71967
Not Stated                              4439
Other Countries in Africa              50634
Other Countries in Americas           140575
Other Countries in Eastern Europe     177367
Other Countries in North Asia          19929
Other Countries in Oceania             19145
Other Countries in South Asia          18856
Other Countries in Southeast Asia      99195
Other Countries in West Asia           40324
Other Countries in Western Europe      42048
Pakistan                               48059
Philippines                          1453775
Poland                                 51365
Rep of Ireland                         59080
Russian Federation (CIS)              180996
Saudi Arabia                           34861
South Africa (Rep of)                  69387
South Korea                          1064903
Spain                                  89532
Sri Lanka                             198287
Sweden                                101419
Switzerland                           163233
Taiwan                                702086
Thailand                              923875
Turkey                                 42564
UK                                   1173629
USA                                  1076939
United Arab Emirates                   36797
Vietnam                               787784
Name: arv_count, dtype: int64

In [8]:
df['year'] = pd.DatetimeIndex(df['period']).year

In [9]:
df.head()

    period    region                          con  arv_count  year
0  2013-01  Americas                       Canada      13080  2013
1  2013-01  Americas                          USA      48815  2013
2  2013-01  Americas  Other Countries in Americas       6742  2013
3  2013-01      Asia            Brunei Darussalam       4709  2013
4  2013-01      Asia                    Indonesia     257842  2013

In [10]:
df['month'] = pd.DatetimeIndex(df['period']).month

In [11]:
df.head()

    period    region                          con  arv_count  year  month
0  2013-01  Americas                       Canada      13080  2013      1
1  2013-01  Americas                          USA      48815  2013      1
2  2013-01  Americas  Other Countries in Americas       6742  2013      1
3  2013-01      Asia            Brunei Darussalam       4709  2013      1
4  2013-01      Asia                    Indonesia     257842  2013      1

In [12]:
df.tail()

       period      region                        con  arv_count  year  month
1339  2014-12      Africa                      Egypt        546  2014     12
1340  2014-12      Africa                  Mauritius       1469  2014     12
1341  2014-12      Africa      South Africa (Rep of)       5002  2014     12
1342  2014-12      Africa  Other Countries in Africa       3028  2014     12
1343  2014-12  Not Stated                 Not Stated         51  2014     12

In [13]:
df.dtypes

period       object
region       object
con          object
arv_count     int64
year          int64
month         int64
dtype: object

In [14]:
df.isna().sum()  #there is no missing data

period       0
region       0
con          0
arv_count    0
year         0
month        0
dtype: int64

In [15]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [22]:
total_visitors_by_year = df.groupby("year")["arv_count"].sum()

In [30]:
total_visitors_by_year

#total visitors has fallen in 2014 by 472,771

year
2013    15567923
2014    15095152
Name: arv_count, dtype: int64

In [31]:
total_visitors_by_region = df.groupby("region").sum()

In [32]:
total_visitors_by_region

            arv_count     year  month
region
Africa         148282   193296    624
Americas      1488051   144972    468
Asia         22941098  1208100   3900
Europe        3762354   966480   3120
Not Stated       4439    48324    156
Oceania       2318851   144972    468

In [33]:
total_visitors_by_region["month"].drop

<bound method Series.drop of region
Africa         624
Americas       468
Asia          3900
Europe        3120
Not Stated     156
Oceania        468
Name: month, dtype: int64>

In [34]:
total_visitors_by_region

            arv_count     year  month
region
Africa         148282   193296    624
Americas      1488051   144972    468
Asia         22941098  1208100   3900
Europe        3762354   966480   3120
Not Stated       4439    48324    156
Oceania       2318851   144972    468